<?php
/**
 * This file is part of apibusiness.
 * Author: wanghongting
 * Date: 2017/12/6
 * Time: 13:50
 * File: constant.php
 */
return [
    //季节配置
    'SEASON' => [
        ['id' => '9cdea92d9cb7fb96ada1b9ae4f97e3d5', 'name' => '春季', 'sequence' => 1], //3,4,5
        ['id' => 'ba8f911b36dbd8128a3d09ed1e2cf029', 'name' => '暑假', 'sequence' => 2], //6,7,8
        ['id' => 'f6f25c131d1c3a64c783be00ebf309a4', 'name' => '秋季', 'sequence' => 3], //9,10,11
        ['id' => '311878b8e6a7e9faab35d04c11ddc70e', 'name' => '寒假', 'sequence' => 4], //12,1,2
    ],
	'GOODS_CLASS_OTMS_TYPE' => '519451b050d44582ab3e08430a00c776',
	//商品类型ID
    'goods_type_id' => [
        'otm'     => '519451b050d44582ab3e08430a00c776',//小班商品类型ID
        'realias' => '519451b050d44582ab3e08430a00c774',//教材商品类型ID
        'roll'    => 'b60e5727f5ce11e78daa4439c44fda44',//滚动班商品类型ID
        'oto'     => '',
    ],
    //考勤状态
    'attendance_status' => [
        1 => '未考勤',
        2 => '出勤',
        3 => '缺勤',
        4 => '退班',
        5 => '转班',
        101 => '已补课',
    ],
    //考勤生成类型
    'attendance_type' => [
        0 => '正常',
        1 => '转入',
        2 => '调入',
    ],
    //性别
    'sex' => [
        '1' => '男',
        '2' => '女'
    ],
    //学员在班级的状态
    'student_status' => [
        2 => '正常',
        3 => '退班',
        4 => '转班',
        100 => '转入',
    ],
    //教材领取的状态
    'receive_status' => [
        1 => '已领取',
        2 => '未领取',
        100 => '未购买',
    ],
    //是否退货
    'refund_name' => [
        1 => '是',
        2 => '否',
    ],
    //班级状态
    'enforce_name' => [
        1 => '正常开班',
        2 => '停班',
        3 => '结课',
        4 => '未开班',
    ],
    //支付方式
    'pay_ment' => [
        'cash' => '现金',
        'pos' => '刷卡POS',
        'weixin' => '微信',
        'alipay' => '支付宝',
        'banktransfer' => '银行转账',
        'cheque' => '支票',
        'account' => '家长账户',
        'qrpos' => '扫码POS',
    ],
    'key_words' => [
        '感恩', '陪伴', '成长', '实力', '优秀', '初心'
    ],
    //平台名称-搜索项
    'order_origin' => [
        'business' => [
            'cb48836df7d1a60b2bc7e06ea8072245',//业务中心
        ],
        'baonahao' => [
            '31e82089b554eaa7d476a439e1923bc6',//报哪好 - 家长 - 触屏版
            '27ecfa91b51968058c76f46c85c94d1a',//报哪好
            'f7a3d19f52d6c5ab7841c7b82f03805a',//报哪好-家长-安卓版
            '3fe47a8a49b600cf84a4365f9cfd68f6',//报哪好-家长-IOS版
        ]
    ],

    //退费方式
    'refund_type' => [
        1 => '线上退班',
        2 => '现金',
        3 => 'pos',
        4 => '支票',
        5 => '转账',
        6 => '退账户',
    ],

    'pay_status' => [
        1 => '已付款',
        2 => '未付款',
        3 => '已退费',
        4 => '已取消',
    ],

    'pay_way' => [
        1 => '支付宝',
        2 => '现金',
        3 => '刷卡POS',
        4 => '微信支付',
        5 => '扫码POS',
        6 => '网银',
        7 => '京东支付',
        8 => '支票',
        13 => '微信',
        14 => '支付宝',
        15 => '银行转账',
        16 => '家长账户',
        17 => '扫码付',
        18 => '支付宝',
    ],
    /**
     * 年部年级
     */
    'grade' => array(
        '学前' => array('小班', '中班', '大班'),
        '小学' => array('一年级', '二年级', '三年级', '四年级', '五年级', '六年级'),
        '初中' => array('初一', '初二', '初三'),
        '高中' => array('高一', '高二', '高三'),
    ),

];
