<?php
/**
 * Created by PhpStorm.
 * User: 15691
 * Date: 2020/5/11
 * Time: 19:18
 */
//$db_config_links = require_once 'database2.php';

//return [
   // 'db_config_links'  =>  $db_config_links
//];
//0-综合,1-其他专科,2-教学医院,3-卫生服务中心,4-妇幼保健,5-中医院
//0-公立,1-私立,2-外资私立,9-表示其他非公立医院
return [
    'type' => [
        '0' => '综合',
        '1' => '其他专科',
        '2' => '教学医院',
        '3' => '卫生服务中心',
        '4' => '妇幼保健',
        '5' => '中医院'
    ],
    'public' => [
        '0' => '公立',
        '1' => '私立',
        '2' => '外资私立',
        '9' => '表示其他非公立医院'
    ]
];